Revit 2024 API
DisplayUnit Enumeration
Describes the type of Revit display unit, metric or imperial.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum DisplayUnit
Visual Basic
Public Enumeration DisplayUnit
Visual C++
public enum class DisplayUnit
Members
Member name | Description
METRIC
IMPERIAL
See Also
Autodesk.Revit.DB Namespace